Revit 2027 API
SpatialFieldManager.UseRangeForAllMeasurements Property
 Governs how minimum and maximum values (the data range) are calculated.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool UseRangeForAllMeasurements { get; set; }
Public Property UseRangeForAllMeasurements As Boolean
	Get
	Set
public:
property bool UseRangeForAllMeasurements {
	bool get ();
	void set (bool value);
}
member UseRangeForAllMeasurements : bool with get, set
Property Value
Boolean
Remarks
 If true the data range is calculated from all measurements. Otherwise the data range is calculated from the current measurement only.
See Also
Reference
SpatialFieldManager Class
Autodesk.Revit.DB.Analysis Namespace